<<<<<<< HEAD

def function(n,m,p):
    i=15
    print(p*pow((1+(i/100)/(m/12)),m/(12*n)))
    
function(int(input("Введите срок депозита: ")),int(input("Введите кол-во начислений процентов в год (1-раз в год, 2-каждые 6 месяцев, 4-каждые 3 месяца): ")),int(input("Введите сумму депозита: ")))



=======
def function(n,m,p):
    i=15
    print(p*pow((1+(i/100)/(m/12)),m/(12*n)))
    
function(int(input("Введите срок депозита: ")),int(input("Введите кол-во начислений процентов в год (1-раз в год, 2-каждые 6 месяцев, 4-каждые 3 месяца): ")),int(input("Введите сумму депозита: ")))


>>>>>>> 34d0a67bca167cfb45d42ec6799ad4332d51d507
